Revit 2027 API
IFCAnyHandle.TypeName Property
 The name of the type of the handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
public:
property String^ TypeName {
	String^ get ();
}
member TypeName : string with get
Property Value
String
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace